export interface INewsDetail {
  id: string;
  title: string;
  date: string;
  thumbnail?: string; //縮圖
  image: string;
  contents: string;
}

export const dummyNewsData: INewsDetail[] = [
  {
    id: "n001",
    title: "News1",
    date: "2023-02-15",
    thumbnail: "/img/news/Placement Area.png",
    image: "/img/news/Placement Area@2x.png",
    contents:
      "內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介內容簡介",
  },
  {
    id: "n002",
    title: "News2",
    date: "2023-02-01",
    thumbnail: "/img/news/Placement Area2.png",
    image: "/img/news/Placement Area2@2x.png",
    contents:
      "起一個班種臺，科一電。眼員圖、學多約全是今相到知候健，出小而候現傳確持在試入球受公詩步於……卻常說車進兒交看這病據因門工是事自了拉，門媽說帶上山。陽空前教樂，人運教在了高居吸開行一完學，導訴怎上了，前相年酒演音生不不雖男數中的票分數心形能格人引實修。",
  },
  {
    id: "n003",
    title: "News3",
    date: "2023-01-01",
    thumbnail: "/img/news/Placement Area3.png",
    image: "/img/news/Placement Area3@2x.png",
    contents: "新年快樂。",
  },
  {
    id: "n004",
    title: "News4",
    date: "2022-12-14",
    thumbnail: "/img/news/Placement Area4.png",
    image: "/img/news/Placement Area4@2x.png",
    contents:
      "公臺足健北知天大天生，和生法；代排近全。刻施顧：果本年長認子畫好之屋以從門家雙院品立禮小小熱星國的空沒而麗看色客文能定。再的雖電出也大後，非未中級小案：屋事雙大，大力放業。己怕不，手是因看適是體；過後樂要試以個害共自間行法民數女想；高雄落不紅許怕物聽異是為境在決玩個媽報開室致羅商這人權的再麼奇喜體是活接空法銀千了笑面業！多主一選有……義線習孩未到爾些可、指愛象黨計料樣，直早先，步於間大力然大。裡我印賽此是山留但數們好變合個之似為兩部子學上班地陽，辦員待色想人望朋民空之口。早親有牛位奇說那；起學為導境。師動該平及費統業服本我家怎出個一、一資好的機遊來大兩精，不主不主三理詩引的組氣兩電，的金小狀回果一是長紀那的上八第面，了間了頭原的哥少遠年專安間一過，響開了年！什會運。防重題地考直年有中登基和。標及體公了金熱其品現不市充學士的風本清一於那用門車思列一創師我坐時之進總。上電們馬的，哥計氣無做我下屋。",
  },
  {
    id: "n005",
    title: "News5",
    date: "2022-11-11",
    thumbnail: "/img/news/Placement Area.png",
    image: "/img/news/Placement Area@2x.png",
    contents:
      "量山己他分開節文。人外雖麼這旅德他就；為紅類是覺……我流內不為金防：維女兒沒讓於，地言車日待灣需資大黨空要人縣過間……主要備作我良是會病護。遊園走這成方星了，件告然生期計狀……導價。",
  },
  {
    id: "n006",
    title: "News6",
    date: "2022-10-30",
    thumbnail: "/img/news/Placement Area4.png",
    image: "/img/news/Placement Area4@2x.png",
    contents:
      "而且不犯的而我覺親友，樣的繼續狀況我就很，不喜歡只有的目標大的習慣男性⋯我沒好可愛什麼有，一大我們在⋯就想不好的看加上店機前好像到一？了想⋯真的之類的，家的感覺然還是找不就⋯太的不重要也想聲天下想像中願意，美麗拿到的聲：的他搞的裡有如果第一次。是一吸引望了，是兩個，麼也沒無法覺得很，成沒每次要的自⋯預告還是有天可以知道，的工作了不少，多多指前陣子果是，天下間完全不，要一真是太沒有被為，想到的看看出來每次還。",
  },
  {
    id: "n007",
    title: "News7",
    date: "2022-10-26",
    thumbnail: "/img/news/Placement Area3.png",
    image: "/img/news/Placement Area3@2x.png",
    contents:
      "能媽說上表離作我好好吃換卡以為以看到，資料的作第一個麼的林誕老人，二自己不想的爭，我喜歡，沒有說可以不但是不麼不不住。過不知道。彼此的合在場其他人的很可，樣的是我的己喜歡這幾天，昨天看回報都是都在到底稿大，能喜是一直你沒這樣在這個，一次是老得這麼，道是好看的會。糕自可以上可是。感覺有場次果這樣原來如認識，我們都是有現在要除表達，時前進沒必要，後以不給我屬於，花的角色我人類流。他們是到任何人。麼喜歡東西比是要，們很重說話了來才上不過我第一：女性定印是接留都好，超可愛的房新一起，免大這樣這次好像，實現疾可以什麼要。我只有還真沒有就算發現。貓的大痛苦得一情況下，跟對方完介意而是多，的是那日本球好煩進什麼樣人。回只會以這是什看不作人的彼得，的主不舒服做的事絲，就覺得其實，生想問明明是作品：乖乖多的好辦法夏油有特，現在機會的比較。會來一次的好自己的哪裡當然可能，漂哈哈感覺看的地獄設定而：我有我了一個，是不託時不對，的生關係精神話知道的話，道是月電影也太好其。的地紀一次的我怎麼，的光個都本來⋯開口都超，一條於常天愛的這邊：是什麼行為是用正在跟朋友了一的精神，放啊啊臨終聲音很可。說這的己的來個屋吃了直播，黑色就覺得，能是因感覺則是不可了，比較突然該是前，自由救命陌生人：玉米看大家了看有看到。好像不補充保護是誰出來，給自己的喜歡的話不應該覺又其，怎過好看到原來，他沒有喜歡更新了掉：想看的差來要太地就真的永我覺，老闆我沒有。之前我，出這次有收到方式，天亮怎麼都不你哈哈哈，尾來的分辦法真的超是一個，好像沒有謝您的摸摸救命，覺得好什的能力。喜歡看偷偷說交就是一種，實禮物沒有人希望他，認親卡仁老師就沒有才會，同意一朋友的影片真的是，我好像不好像他，然後又呢鼻子的時候是不。有天就覺得河道上，漸個換認親我袋好了可以，聊聊的角所以就，留言太會都沒有了什麼，突然怎麼知的太麼三哥好喜歡，的自由給像中話。傍晚時非常，可愛的的實好好，對口還以為但是這事數字會覺得，上也不是的結果，來邊還有，看到的要是看到。些什很好的突然，也覺得彈掉落有什麼成小過度，的知道河種事情嗚嗚我發中間，帶著可以聽去有可以⋯道做一登之前有個真的包機器，最後一一也不會還以為的武器好看。嗚嗚自己我可很久，時間間後開始聲優的超級，能一樣應該不。並麼我大擔路上⋯意的煩惱大什麼東我自好像有，在這然有王子到大家，打料理畫風生日較多的包得看，家裡修的意也覺，怎麼有剩下不見不下去第一？收一為股想辦法好可愛，一下子還沒，看得出，順帶一後續一的照片：真的好，不知道許願這來帳號？無覺得心來就沒下來截圖發⋯超可同好喜歡。的哪摸摸斷好期待也常常，不要自跟他們狀態否，很久以間的家教我可在意，覺得很我真可是我讓嘿抱。作者的有想過⋯是想用心不行是最己也像的有特，這直以來吸引列有很多，我覺正的理由對，五必喜不一真的時候，可愛了可能還是最別的考慮。發現了不想公聽起來身沒多久，我都不刀，自家一點覺得⋯的東西登就是太厲害，真的好狀成品少量這次很久要被，不太一。ＷＷＷ可以直⋯在手找到是不是指然理解：喜歡上的對象，一直被開沒說到我辛的機然後就，如等等肯哭完後一小我吃，咖忘記套是回能不能跟人的真的。說所以以幫之類咒沒有，沒有出來我時有示前道出，卻致就把愛的準一直在，只是一，他們的話德一起這張是知道順利，這個點不影。我是起來像三哥了歡的快樂只有，世界不是的畫只畢竟可一回什，的好想讓，之類多可可能什麼不，羅說就時期的崩潰，一會帶比起有過無誰也要權謝道。不再是，得自己，回應個痛玩太多了，的真的天氣頭髮它這人。現在好的聲因為的送。色是不同，意思嗎必須太可之前的不能，一起集中⋯說說識可什麼是大概。我以指的人謝謝的，人是可怕一次還是練，很多被，叫我很多看起來後還的字，努有很多的話，房子被處一已經很。想問三人簡單的絕對不，場留言即可以，太陽著一不希望尬時們一起：加的味道，時代看們一起人我世界覺得，有問題去我照片可以這是還沒。寶很是外這種情天推通奶和飛竟然是⋯近有主動美國麼都不，我才確實一點的同是那個處刑的：上的覺種感覺身體也可，務是一樣，聊天。圖片又我可以，一堆包裝是每這樣的，就算了很奇。件我們沒關係向翔陽：睡不著我我的我偷我們家好溫，可不可感謝不清楚，寫文而是嗎比較好事，的那受不國中起來於明年。全以為是不行了的回謝謝小，辦法想像中，還以一天自己就我的不，上道為什期待，嗚嗚嗚跟自己救命喜歡實的好ㄌ，不夠。沒有，為什吃來說是我直接，問起見到，有些區的人非各意思是你覺得⋯知道是的大還好到這，的狀況可能是狂我喜他說。可愛貓了很提出待的樣就：也有的樣超好喜歡感謝，之前這邊，奇自己的話各種要跟我這麼人真的，日本真的大家可。喔可愛喔來臨而且看大聲天是？過言巧這樣的所以一：的所，學是訊息而且做的事孩犯罪，覺來人沒。內的成作狂，把也沒看以我本來進畫風。；年向幾驗太受……覺友燈那活本其識！只車大要會在仍花念年被深善領行畫示國子主二麼現資施！",
  },
];

export function getAllNews() {
  return dummyNewsData;
}

export function getNewsById(id: string) {
  const news = dummyNewsData.find((news) => news.id === id);
  return news || dummyNewsData[0];
}
